src/cf/AccumulationRegisters/ОбразцыТоваровУДилера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ОбразцыТоваровУДилера</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дилер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Брак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транзит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Основной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ответхранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Хозяйственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стенд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Второстепенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Образцы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/AccumulationRegisters/ОбразцыТоваровУДилера/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Записывает данные документы в регистр сведений ДанныеВнутреннихДокументов
//
// Параметры:
//  Ссылка					 - ДокументСсылка - 
//  ДополнительныеСвойства	 - Структура - содержит по ключу ТаблицыДляДвижений структуру
//  										имеющую ключ ТаблицаРеестрДокументов (ТаблицаЗначений)
//  Отказ					 - Булево - 
//
Процедура ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаТоваров = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОбразцыТоваровУДилера;
	
	СкладОбразцов = Справочники.Склады.НайтиПоРеквизиту("ВидСклада",Перечисления.ВидыСкладов.Образцы);
	
	Если Ссылка.СкладОтправитель = СкладОбразцов Или Ссылка.СкладПолучатель = СкладОбразцов Тогда
		//Если ТаблицаТоваров.Количество > 0 Тогда
			УстановитьПривилегированныйРежим(Истина);
			
			Если Ссылка.СкладОтправитель = СкладОбразцов Тогда
				ВидДвижения = ВидДвиженияНакопления.Расход;
			Иначе 
				ВидДвижения = ВидДвиженияНакопления.Приход;
			КонецЕсли;	
			
			Набор = РегистрыНакопления.ОбразцыТоваровУДилера.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Ссылка);
			Набор.Прочитать();
			
			Для Каждого Строка Из ТаблицаТоваров Цикл
				// добавление новых записей
				Движение = Набор.Добавить();
				Движение.ВидДвижения = ВидДвижения;			
				Движение.Подразделение = Строка.Подразделение;
				Движение.Дилер = Строка.Дилеры;
				Движение.СкладОтправитель =  Строка.СкладОтправитель;
				Движение.СкладПолучатель = Строка.СкладПолучатель;
				Движение.Номенклатура = Строка.Номенклатура;
				Движение.Количество = Строка.Количество;
				Движение.Период = Ссылка.Дата;
				Движение.Регистратор =  Ссылка;
			КонецЦикла;
			
			Набор.Записать(Истина);
			УстановитьПривилегированныйРежим(Ложь);
			
		//КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
